{
  "vocab": [
    "10",
    "2",
    "3",
    "6",
    "8",
    "a",
    "about",
    "absolut",
    "access",
    "accessori",
    "account",
    "ach",
    "achiev",
    "act",
    "activ",
    "add",
    "advic",
    "after",
    "afternoon",
    "again",
    "agre",
    "ahead",
    "all",
    "alright",
    "altern",
    "am",
    "an",
    "analyz",
    "and",
    "ankl",
    "anoth",
    "app",
    "appreci",
    "ar",
    "arch",
    "as",
    "ask",
    "assess",
    "assist",
    "at",
    "athlet",
    "avoid",
    "awai",
    "awesom",
    "back",
    "bad",
    "badli",
    "band",
    "bar",
    "barbel",
    "basic",
    "bcaa",
    "be",
    "befor",
    "beginn",
    "below",
    "bench",
    "best",
    "better",
    "bigger",
    "bio",
    "bodi",
    "bodyweight",
    "bot",
    "bother",
    "brace",
    "brag",
    "break",
    "breakfast",
    "breath",
    "broken",
    "buddi",
    "build",
    "burn",
    "button",
    "bye",
    "calcul",
    "calendar",
    "calf",
    "can",
    "cancel",
    "cardio",
    "casein",
    "catch",
    "challeng",
    "chang",
    "check",
    "cheer",
    "chest",
    "chinup",
    "ciao",
    "class",
    "close",
    "coach",
    "coffe",
    "come",
    "commun",
    "confus",
    "consult",
    "convent",
    "convinc",
    "core",
    "correct",
    "could",
    "count",
    "cours",
    "creat",
    "creatin",
    "cue",
    "current",
    "cya",
    "cycl",
    "d",
    "dai",
    "dashboard",
    "deadlift",
    "deeper",
    "deficit",
    "definit",
    "dehydr",
    "delet",
    "deload",
    "demotiv",
    "depth",
    "detail",
    "did",
    "didn",
    "differ",
    "difficulti",
    "disabl",
    "do",
    "doe",
    "doesn",
    "don",
    "done",
    "down",
    "drink",
    "drive",
    "drop",
    "dumbbel",
    "dure",
    "easier",
    "edit",
    "elabor",
    "elbow",
    "electrolyt",
    "ellipt",
    "enabl",
    "encourag",
    "energi",
    "enough",
    "enter",
    "equip",
    "even",
    "everi",
    "everyth",
    "everywher",
    "exercis",
    "exhaust",
    "explain",
    "extern",
    "far",
    "fast",
    "faster",
    "fastest",
    "fat",
    "fat_loss",
    "fatigu",
    "feed",
    "feel",
    "find",
    "fine",
    "first",
    "fish",
    "fit",
    "fitlif",
    "flat",
    "focu",
    "follow",
    "food",
    "for",
    "forget",
    "form",
    "frequenc",
    "friend",
    "front",
    "full",
    "gain",
    "gener",
    "get",
    "give",
    "go",
    "goal",
    "goblet",
    "good",
    "goodby",
    "got",
    "gotta",
    "great",
    "greet",
    "grip",
    "group",
    "grow",
    "growth",
    "gui",
    "guid",
    "hamstr",
    "hard",
    "harder",
    "hardgain",
    "hate",
    "have",
    "heat",
    "heavi",
    "hei",
    "hello",
    "help",
    "hi",
    "high",
    "hiit",
    "hing",
    "hip",
    "histori",
    "hiya",
    "home",
    "hour",
    "how",
    "howdi",
    "huh",
    "hurt",
    "hydrat",
    "i",
    "ic",
    "idea",
    "if",
    "import",
    "improv",
    "in",
    "inclin",
    "increas",
    "info",
    "injur",
    "injuri",
    "intak",
    "intens",
    "interest",
    "intermitt",
    "into",
    "is",
    "it",
    "jump",
    "just",
    "keep",
    "keto",
    "kettlebel",
    "kg",
    "kidnei",
    "knee",
    "knowledg",
    "later",
    "lazi",
    "lean",
    "leav",
    "leg",
    "less",
    "let",
    "level",
    "lift",
    "light",
    "like",
    "load",
    "lock",
    "lockout",
    "log",
    "long",
    "look",
    "lose",
    "loss",
    "lost",
    "lot",
    "love",
    "low",
    "lower",
    "lung",
    "m",
    "machin",
    "macro",
    "magnesium",
    "make",
    "mani",
    "manual",
    "mark",
    "matter",
    "maxim",
    "me",
    "mean",
    "mhm",
    "mind",
    "minor",
    "minut",
    "miss",
    "modifi",
    "monthli",
    "more",
    "morn",
    "motiv",
    "much",
    "muscl",
    "muscle_gain",
    "my",
    "myself",
    "nah",
    "name",
    "navig",
    "neck",
    "need",
    "neg",
    "neutral",
    "never",
    "nevermind",
    "new",
    "next",
    "nice",
    "night",
    "no",
    "nope",
    "normal",
    "not",
    "notif",
    "now",
    "number",
    "nutrit",
    "of",
    "off",
    "often",
    "oil",
    "ok",
    "okai",
    "on",
    "onli",
    "open",
    "or",
    "out",
    "outsid",
    "overhead",
    "overload",
    "pain",
    "parallel",
    "password",
    "past",
    "peac",
    "peopl",
    "pep",
    "per",
    "perfect",
    "person",
    "photo",
    "pictur",
    "plan",
    "pleas",
    "posit",
    "post",
    "pound",
    "powder",
    "pre",
    "prep",
    "press",
    "profil",
    "program",
    "progress",
    "proper",
    "properli",
    "pull",
    "pullup",
    "push",
    "pushup",
    "put",
    "question",
    "quit",
    "quiz",
    "rack",
    "rang",
    "rather",
    "rdl",
    "re",
    "realli",
    "record",
    "recoveri",
    "reduc",
    "regener",
    "remind",
    "rep",
    "rephras",
    "replac",
    "report",
    "result",
    "review",
    "rice",
    "right",
    "rock",
    "romanian",
    "rope",
    "round",
    "routin",
    "row",
    "rule",
    "run",
    "s",
    "safe",
    "sai",
    "salt",
    "save",
    "schedul",
    "scheme",
    "screen",
    "see",
    "sens",
    "set",
    "share",
    "should",
    "shoulder",
    "show",
    "sign",
    "size",
    "skinni",
    "skip",
    "slept",
    "snack",
    "so",
    "sound",
    "sourc",
    "sparkl",
    "spin",
    "split",
    "squat",
    "stack",
    "stairmast",
    "stand",
    "start",
    "stat",
    "state",
    "statu",
    "steadi",
    "step",
    "stiff",
    "strain",
    "strategi",
    "streak",
    "strength",
    "stretch",
    "stronger",
    "structur",
    "struggl",
    "substitut",
    "summar",
    "summari",
    "sumo",
    "sup",
    "super",
    "supplement",
    "sure",
    "swap",
    "swim",
    "t",
    "tab",
    "take",
    "talk",
    "target",
    "tdee",
    "techniqu",
    "tell",
    "test",
    "thank",
    "that",
    "the",
    "there",
    "thi",
    "think",
    "through",
    "thx",
    "tight",
    "time",
    "tip",
    "tire",
    "to",
    "todai",
    "tomorrow",
    "tone",
    "too",
    "total",
    "tougher",
    "track",
    "train",
    "trap",
    "treadmil",
    "trivia",
    "true",
    "ttyl",
    "tweak",
    "ty",
    "uh",
    "understand",
    "unmotiv",
    "up",
    "updat",
    "us",
    "vegan",
    "version",
    "view",
    "vitamin",
    "vs",
    "wai",
    "walk",
    "want",
    "water",
    "we",
    "weak",
    "week",
    "weekli",
    "weight",
    "weird",
    "well",
    "what",
    "whei",
    "when",
    "where",
    "why",
    "wide",
    "width",
    "with",
    "without",
    "won",
    "work",
    "workout",
    "worth",
    "wrist",
    "x",
    "xp",
    "ya",
    "ye",
    "yeah",
    "yep",
    "yo",
    "yoga",
    "you",
    "yup",
    "zone"
  ],
  "intents": [
    "greeting",
    "ask_plan_today",
    "ask_workout_advice",
    "nutrition_question",
    "motivation",
    "rest_day_advice",
    "injury_concern",
    "equipment_swap",
    "log_question",
    "progress_question",
    "goodbye",
    "thanks",
    "confusion",
    "affirmation",
    "negation",
    "app_help",
    "share_progress",
    "ask_set_rep_scheme",
    "form_check",
    "swap_exercise",
    "nutrition_macros",
    "hydration",
    "sleep_recovery",
    "progression_request",
    "quiz_request",
    "app_navigation",
    "exercise_squat",
    "exercise_deadlift",
    "exercise_bench_press",
    "exercise_pullup",
    "cardio_advice",
    "weight_loss_tips",
    "muscle_gain_tips",
    "supplement_question",
    "consult_me"
  ],
  "threshold": 0.45
}