{
  "vocab": [
    "a",
    "access",
    "activ",
    "advic",
    "after",
    "afternoon",
    "all",
    "altern",
    "am",
    "an",
    "appreci",
    "as",
    "at",
    "back",
    "bad",
    "band",
    "barbel",
    "be",
    "befor",
    "bench",
    "best",
    "better",
    "bodi",
    "bodyweight",
    "bother",
    "build",
    "button",
    "bye",
    "calori",
    "can",
    "carb",
    "cardio",
    "catch",
    "cheer",
    "coach",
    "convinc",
    "count",
    "creatin",
    "current",
    "dai",
    "demotiv",
    "did",
    "diet",
    "do",
    "don",
    "done",
    "dumbbel",
    "eat",
    "elbow",
    "enter",
    "equip",
    "even",
    "everi",
    "exercis",
    "faster",
    "fat",
    "feel",
    "focu",
    "food",
    "for",
    "full",
    "gain",
    "get",
    "give",
    "go",
    "good",
    "goodby",
    "got",
    "gotta",
    "great",
    "group",
    "gym",
    "hamstr",
    "have",
    "heavi",
    "hei",
    "hello",
    "help",
    "hi",
    "home",
    "how",
    "howdi",
    "hurt",
    "hypertrophi",
    "i",
    "idea",
    "if",
    "import",
    "improv",
    "in",
    "info",
    "injur",
    "injuri",
    "is",
    "it",
    "just",
    "kettlebel",
    "knee",
    "later",
    "lazi",
    "level",
    "lift",
    "light",
    "like",
    "log",
    "long",
    "lose",
    "lot",
    "m",
    "machin",
    "mani",
    "manual",
    "mark",
    "me",
    "meal",
    "monthli",
    "morn",
    "motiv",
    "much",
    "muscl",
    "my",
    "myself",
    "need",
    "night",
    "no",
    "nutrit",
    "often",
    "ok",
    "okai",
    "on",
    "onli",
    "or",
    "out",
    "overload",
    "pain",
    "pep",
    "per",
    "plan",
    "pleas",
    "post",
    "pre",
    "prep",
    "press",
    "progress",
    "protein",
    "pull",
    "quit",
    "rang",
    "re",
    "record",
    "recov",
    "recoveri",
    "rep",
    "replac",
    "rest",
    "s",
    "save",
    "see",
    "session",
    "set",
    "sharp",
    "should",
    "shoulder",
    "show",
    "skip",
    "sore",
    "split",
    "squat",
    "stat",
    "strain",
    "streak",
    "strength",
    "stronger",
    "substitut",
    "sup",
    "super",
    "supplement",
    "swap",
    "t",
    "take",
    "talk",
    "thank",
    "that",
    "the",
    "there",
    "thi",
    "think",
    "through",
    "thx",
    "tip",
    "tire",
    "to",
    "todai",
    "tomorrow",
    "track",
    "train",
    "tweak",
    "ty",
    "up",
    "wai",
    "want",
    "week",
    "weekli",
    "weight",
    "what",
    "when",
    "where",
    "with",
    "without",
    "work",
    "workout",
    "wrist",
    "xp",
    "ya",
    "yo",
    "you"
  ],
  "intents": [
    "greeting",
    "ask_plan_today",
    "ask_workout_advice",
    "nutrition_question",
    "motivation",
    "rest_day_advice",
    "injury_concern",
    "equipment_swap",
    "log_question",
    "progress_question",
    "goodbye",
    "thanks"
  ],
  "threshold": 0.45
}